jobs/20260724-102000-luqia-vllm-gate-ablation-exclusive-off/saturation_gate_results/bench_12_final_recovery.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7e18990d5120>, seed=0, num_prompts=12, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=128, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30025', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-931e259f-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-24 10:35:25 [datasets.py:612] Sampling input_len from [127, 127] and output_len from [32, 32]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:01<00:00,  1.98s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 12/12 [00:14<00:00,  1.18s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     12        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  14.16     
Total input tokens:                      1524      
Total generated tokens:                  384       
Request throughput (req/s):              0.85      
Output token throughput (tok/s):         27.11     
Peak output token throughput (tok/s):    51.00     
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          134.71    
---------------Time to First Token----------------
Mean TTFT (ms):                          244.54    
Median TTFT (ms):                        249.06    
P99 TTFT (ms):                           287.32    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          61.53     
Median TPOT (ms):                        62.06     
P99 TPOT (ms):                           62.48     
---------------Inter-token Latency----------------
Mean ITL (ms):                           61.53     
Median ITL (ms):                         61.85     
P99 ITL (ms):                            71.55     
==================================================